/* --------------------------------------------------------------
### Задача №2 ###
-----------------------------------------------------------------
Реализовать алгоритм пирамидальной сортировки (сортировка кучей).
-------------------------------------------------------------- */

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}